{
  "education": [
    {
      "awards_achievements": [],
      "degree": "Bachelor of Science in Honours",
      "department": "Computer Science",
      "duration": "2018-2023",
      "school_name": "Trent University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MichaelAdebayo",
  "highlighted_projects": [
    {
      "description": "Programmed a simple text-based game where you, as a Pokemon Trainer, can select a Pokemon type, battle against computer opponents, and level up your Pokemon. The game features elemental advantages and disadvantages depending on the enemy Pokemon, as well as varying success rates for different attacks. This is a Java console game.\n",
      "git_url": "https://github.com/MichaelAdebayo/Pokemon_Project",
      "name": "Pokemon Trainer Game"
    },
    {
      "description": "Collaborated with classmates to develop a Dental web application using HTML, CSS, and JavaScript. The application allows dentists to log in to a dashboard, pulls customer data from an existing MySQL database using PHP, and guides users in cleaning the exported data. The application was designed to help dentists gain a better understanding of their client data and address the business needs of their practice.\n",
      "git_url": "https://github.com/MichaelAdebayo/SchoolProject",
      "name": "Dental Practice Web Application"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Completed a project that aimed to create scripts capable of collecting hardware data and resource usage data. This enabled the Jarvis Linux Cluster Administration to manage resources within a cluster effectively. The project utilized the Linux command line interface, Bash scripts for data collection, and a PSQL database for storage. The project was containerized using Docker and hosted on Google Cloud Platform. A tool called REALVNC was used to view the virtual machine.\n",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MichaelAdebayo/blob/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Core Java Apps:\nGrep App: Developed an application mimicking the Linux grep command, allowing users to search for matching strings within files using regular expressions. The application recursively searches within a target directory for files that match the expression and returns the results. It can be run using a Docker image or locally using a JAR file.\nStock Quote App: Completed a Stock Quote application that allows users to manage and track stock positions by interacting with a PostgreSQL database. The application retrieves real-time stock data using the Alpha Vantage API, with data parsing handled by JSON and HTTP requests managed via the OkHttp library. The project was implemented in Java, employing the DAO design pattern to separate business logic from data access. Testing was done using JUnit and Mockito as well as manual testing to ensure the application ran correctly. The application was containerized with Docker for easy deployment.\n",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_MichaelAdebayo/blob/main/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Michael Adebayo",
  "others": [
    {
      "bullets": [
        "Skill Hat Career Accelerator Course (2022 - 2023)",
        "CompTIA IT Fundamentals (2022)",
        "Microsoft Azure Fundamentals: Cloud Computing (2023)",
        "CIBC: Introduction to Cloud (2023)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Basketball player: Apart of a basketball league, One of the captains",
        "Book-club member: Bi-Weekly, meeting discussing books that we have read"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "As a developer at Jarvis, I am in a training program that is helping me to gain experience in industry standards. I worked on a Cluster monitoring project involving Bash and Linux, which has helped me continually improve my technical skills and prepared me to work in a professional environment.\n",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Canadian Imperial Bank of Commerce",
      "description": "Conducted performance testing and analysis on software applications and provided feedback to developers when necessary to improve applications. Tested use cases both manually and using scripting software like Unified Functional Testing (UFT). Provided reports to management using Microsoft Excel and discussed any abnormal testing results.\n",
      "duration": "2022 - 2023",
      "title": "Performance Test Analyst"
    }
  ],
  "skills": {
    "competent": [
      "C#",
      "Docker",
      "Linux",
      "Bash",
      "MySQL"
    ],
    "familiar": [
      "HTML",
      "CSS",
      "Rust",
      "C++",
      "Springboot"
    ],
    "proficient": [
      "Java",
      "Python",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I hold a Bachelor of Science Honors degree in Computer Science from Trent University. My professional journey began as a Performance Test Analyst at CIBC where I tested applications and provided feedback to developers in order to improve the performance and user experience of the applications. I am currently employed at Jarvis as a Junior Software Engineer, in which I am in a training program that is helping me to gain hands-on experience working professionally. What excites me about the software industry is the opportunity to continue to learn and problem-solve.\n"
}
